mKoDba/nrf51_muha/application/bsp/bsp_mpu9150.c
    twi_tx_done = false;

#else
    twi_master_transfer((inDevice->config->mpuAddress << 1u) | 0u, &msg[0], 2u, false);
#endif // (DEPRECATED_TWI == false)

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***********************************************************************************************//**
 * @brief Function for reading from single register of MPU9150.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [in]  regAddr      - register address.
 * @param [in]  *data        - pointer to data to read.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
static void BSP_MPU9150_readSingleReg(BSP_MPU9150_device_S *inDevice,
        uint8_t regAddr,
        uint8_t *data,
        BSP_MPU9150_err_E *outErr) {

    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
#if (DEPRECATED_TWI == false)
    uint32_t err_code;
    volatile uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;
#endif // (DEPRECATED_TWI == false)

#if (DEPRECATED_TWI == false)
    // after first START condition send |SLAVE_ADDR+W|REG_ADDR|
    err_code = nrf_drv_twi_tx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            &regAddr,
            1u,
            false);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!twi_tx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    twi_tx_done = false;

    // after second START condition read in data from register
    err_code = nrf_drv_twi_rx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            data,
            1u);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    timeout = BSP_MPU9150_TWI_TIMEOUT;
    while((!twi_rx_done) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    twi_rx_done = false;

#else
    // TX first the reg address with write bit
    twi_master_transfer((inDevice->config->mpuAddress << 1u) | 0u, &regAddr, 1u, false);

    // RX data from register (single - 1 byte)
    twi_master_transfer((inDevice->config->mpuAddress << 1u) | 1u, data, 1u, false);
#endif // (DEPRECATED_TWI == false)

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***********************************************************************************************//**
 * @brief Function for reading from multiple successive registers of MPU9150.
 ***************************************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for MPU-9150 driver.
 * @param [in]  startRegAddr - starting register address.
 * @param [in]  length       - number of registers (bytes) to read.
 * @param [in]  *data        - pointer to data to read.
 * @param [out] *outErr      - error parameter.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    15.05.2021
 **************************************************************************************************/
static void BSP_MPU9150_readMultiReg(BSP_MPU9150_device_S *inDevice,
        uint8_t startRegAddr,
        const uint8_t length,
        uint8_t *data,
        BSP_MPU9150_err_E *outErr) {

    BSP_MPU9150_err_E err = BSP_MPU9150_err_NONE;
#if (DEPRECATED_TWI == false)
    uint32_t err_code;
    volatile uint32_t timeout = BSP_MPU9150_TWI_TIMEOUT;
#endif // (DEPRECATED_TWI == false)

#if (DEPRECATED_TWI == false)
    // after first START condition send |SLAVE_ADDR+W|START_REG_ADDR|
    err_code = nrf_drv_twi_tx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            &startRegAddr,
            1u,
            false);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    while((!inDevice->twiTxDone) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    inDevice->twiTxDone = false;

    // after second START condition read in data from registers
    err_code = nrf_drv_twi_rx(inDevice->twiInstance,
            inDevice->config->mpuAddress,
            data,
            length);

    if(err_code != NRF_SUCCESS) {
        err = BSP_MPU9150_err_I2C_READ_WRITE;
    }

    // TODO: add proper timeout check with timer
    // wait for transfer finish or timeout
    timeout = BSP_MPU9150_TWI_TIMEOUT;
    while((!inDevice->twiRxDone) && --timeout);

    if(!timeout) {
        err = BSP_MPU9150_err_I2C_TIMEOUT;
    }
    inDevice->twiRxDone = false;

#else
    // TX first the register address with write bit
    err = twi_master_transfer((inDevice->config->mpuAddress << 1u) | 0u, &startRegAddr, 1u, false);

    // RX data from register
    err &= twi_master_transfer((inDevice->config->mpuAddress << 1u) | 1u, data, length, true);

    err = 1 ? 0 : err;
#endif

    if(outErr != NULL) {
        *outErr = err;
    }
}

/***********************************************************************************************//**
 * @brief Function calculates temperature value in degrees using datasheet conversion function.
 ***************************************************************************************************
 * @param  [in]  rawValue     -   pointer to raw temperature value, read from register.
 * @param  [out] *outTemp     -   pointer to output temperature data.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    25.05.2021
 **************************************************************************************************/
__INLINE static void BSP_MPU9150_calculateTemperature(const uint8_t *rawValue, int16_t *outTemp) {

    int16_t retVal = 0;

    retVal = rawValue[1] + (rawValue[0] << 8u);
    retVal = retVal / BSP_MPU9150_TEMP_CONVERSION_CONST_1 + BSP_MPU9150_TEMP_CONVERSION_CONST_2;
    *outTemp = retVal;
}

/***********************************************************************************************//**
 * @brief Function calculates gyroscope value using datasheet conversion function.
 ***************************************************************************************************
 * @param  [in]  *inDevice    - pointer to device structure for MPU-9150 driver.
 * @param  [in]  *rawValue    - pointer to raw gyroscope measurements, read from register in bytes.
 * @param  [out] *outGyro     - pointer to calculated gyroscope values in degree/seconds.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    25.05.2021
 **************************************************************************************************/
__INLINE static void BSP_MPU9150_calculateGyroValues(const BSP_MPU9150_device_S *inDevice,
        const uint8_t *rawValue,
        int16_t *outGyro) {

    int16_t gyroX = 0;
    int16_t gyroY = 0;
    int16_t gyroZ = 0;

    float floatGyroX = 0.f;
    float floatGyroY = 0.f;
    float floatGyroZ = 0.f;

    gyroX = rawValue[1] + (rawValue[0] << 8u);
    gyroY = rawValue[3] + (rawValue[2] << 8u);
    gyroZ = rawValue[5] + (rawValue[4] << 8u);

