mKoDba/nrf51_muha/application/bsp/bsp_mpu9150.c
    // this will give the real (interpreted) value in degree/seconds
    switch(inDevice->config->gyroRange) {
        default:
        case BSP_MPU9150_gyroFsRange_250degS:
            floatGyroX = ((float) gyroX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_250DEG_CONST;
            floatGyroY = ((float) gyroY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_250DEG_CONST;
            floatGyroZ = ((float) gyroZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_250DEG_CONST;
            break;
        case BSP_MPU9150_gyroFsRange_500degS:
            floatGyroX = ((float) gyroX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_500DEG_CONST;
            floatGyroY = ((float) gyroY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_500DEG_CONST;
            floatGyroZ = ((float) gyroZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_500DEG_CONST;
            break;
        case BSP_MPU9150_gyroFsRange_1000degS:
            floatGyroX = ((float) gyroX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_1000DEG_CONST;
            floatGyroY = ((float) gyroY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_1000DEG_CONST;
            floatGyroZ = ((float) gyroZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_1000DEG_CONST;
            break;
        case BSP_MPU9150_gyroFsRange_2000degS:
            floatGyroX = ((float) gyroX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_2000DEG_CONST;
            floatGyroY = ((float) gyroY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_2000DEG_CONST;
            floatGyroZ = ((float) gyroZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_GYRO_RANGE_2000DEG_CONST;
            break;
    }

    // output it as 16-bit values
    gyroX = (int16_t) floatGyroX;
    gyroY = (int16_t) floatGyroY;
    gyroZ = (int16_t) floatGyroZ;

    // X-axis Gyro
    outGyro[0] = gyroX;
    // Y-axis Gyro
    outGyro[1] = gyroY;
    // Z-axis Gyro
    outGyro[2] = gyroZ;

}

/***********************************************************************************************//**
 * @brief Function calculates accelerometer value using datasheet conversion function.
 ***************************************************************************************************
 * @param  [in]  *inDevice    - pointer to device structure for MPU-9150 driver.
 * @param  [in]  *rawValue    - pointer to raw gyroscope measurements, read from register in bytes.
 * @param  [out] *outAcc      - pointer to calculated accelerometer values in G.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    25.05.2021
 **************************************************************************************************/
__INLINE static void BSP_MPU9150_calculateAccValues(const BSP_MPU9150_device_S *inDevice,
        const uint8_t *rawValue,
        int16_t *outAcc) {

    int16_t accX = 0;
    int16_t accY = 0;
    int16_t accZ = 0;

    float floatAccX = 0.f;
    float floatAccY = 0.f;
    float floatAccZ = 0.f;

    accX = rawValue[1] + (rawValue[0] << 8u);
    accY = rawValue[3] + (rawValue[2] << 8u);
    accZ = rawValue[5] + (rawValue[4] << 8u);

    // this will give the real (interpreted) value in G
    switch(inDevice->config->accRange) {
        default:
        case BSP_MPU9150_accFsRange_2G:
            floatAccX = ((float) accX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_2G_CONST;
            floatAccY = ((float) accY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_2G_CONST;
            floatAccZ = ((float) accZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_2G_CONST;
            break;
        case BSP_MPU9150_accFsRange_4G:
            floatAccX = ((float) accX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_4G_CONST;
            floatAccY = ((float) accY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_4G_CONST;
            floatAccZ = ((float) accZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_4G_CONST;
            break;
        case BSP_MPU9150_accFsRange_8G:
            floatAccX = ((float) accX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_8G_CONST;
            floatAccY = ((float) accY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_8G_CONST;
            floatAccZ = ((float) accZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_8G_CONST;
            break;
        case BSP_MPU9150_accFsRange_16G:
            floatAccX = ((float) accX / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_16G_CONST;
            floatAccY = ((float) accY / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_16G_CONST;
            floatAccZ = ((float) accZ / BSP_MPU9150_16_BIT_SIGNED_MAX_VAL_FLOAT) * BSP_MPU9150_ACC_RANGE_16G_CONST;
            break;
    }

    // output values in mG, that way they can be stored as 16-bit
    accX = (int16_t) (floatAccX * 1000);
    accY = (int16_t) (floatAccY * 1000);
    accZ = (int16_t) (floatAccZ * 1000);

    // X-axis Accelerometer
    outAcc[0] = accX;
    // Y-axis Accelerometer
    outAcc[1] = accY;
    // Z-axis Accelerometer
    outAcc[2] = accZ;

}

/***********************************************************************************************//**
 * @brief Function calculates temperature value in degrees using datasheet conversion function.
 ***************************************************************************************************
 * @param  [in]  *gyroVals      -   pointer to 16-bit interpreted gyro data (deg/s).
 * @param  [in]  *accVals       -   pointer to 16-bit interpreted accelerometer data (mG).
 * @param  [in]  temp           -   interpreted temperature value.
 * @param  [out] *outBuffer     -   pointer to output buffer which is sent over BLE.
 ***************************************************************************************************
 * @author  mario.kodba
 * @date    25.05.2021
 **************************************************************************************************/
__INLINE static void BSP_MPU9150_packDataToSend(const int16_t *gyroVals,
        const int16_t *accVals,
        const int16_t temp,
        int16_t *outBuffer) {

    outBuffer[0] = gyroVals[0];
    outBuffer[1] = gyroVals[1];
    outBuffer[2] = gyroVals[2];

